Revit 2027 API
FillPatternElement.GetFillPattern Method
 Gets the FillPattern associated to this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPattern GetFillPattern()
Public Function GetFillPattern As FillPattern
public:
FillPattern^ GetFillPattern()
member GetFillPattern : unit -> FillPattern
Return Value
FillPattern
 A copy of FillPattern object.
See Also
Reference
FillPatternElement Class
Autodesk.Revit.DB Namespace